Revit 2026 API

# PaperPlacementType Enumeration

---

An enumerated type listing all Paper Placement types of Print Setting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PaperPlacementType
```
```vb
Public Enumeration PaperPlacementType
```
```cpp
public enum class PaperPlacementType
```
```fsharp
type PaperPlacementType
```

| Member name | Value | Description |
| --- | --- | --- |
| Center | 0 | The type of Paper Placement is Center. |
| LowerLeft | 1 | The type of Paper Placement is LowerLeft. |
| Margins | 1 | The type of Paper Placement is Margins. It's obsolete, use LowerLeft instead. |

#### Reference

Autodesk.Revit.DB Namespace